// This will search vulnearbility severity level Critical and High
// for the machine listed
let iocs = externaldata(vmname:string,ipaddress:string) [@"https://raw.githubusercontent.com/davanitz/huntingioc/main/hapi.csv"] with (format="csv", ignoreFirstRecord=True);
//let ip = "10.140.108.112";
let ip = (iocs | project ipaddress);
let devnetinfo =
DeviceNetworkInfo 
| where IPAddresses has_any (ip)
| extend ipadd = parse_json(IPAddresses)
| extend address = ipadd[0]
| evaluate bag_unpack(address)
| project-away IPAddresses, ipadd, AddressType, SubnetPrefix
//| distinct DeviceName, DeviceId, IPAddress 
;
let filterip =
devnetinfo
| join ip on $left.IPAddress == $right.ipaddress
;
(union isfuzzy=true
DeviceTvmSoftwareVulnerabilities
| join filterip on DeviceId
| where VulnerabilitySeverityLevel has_any ("Critical","High")
| distinct DeviceName, DeviceId, IPAddress
)
